Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/your_rights_when_you_buy_a_service.html.txt.tmx
Source language: en
Languages: ga

source: Your rights when you buy a service
ga: Do chearta nuair a cheannaíonn tú seirbhís

source: Services can range from getting a hair cut to having a house built
ga: Tá réimse leathan i gceist le ‘seirbhís’, ó bhearradh gruaige go tógáil tí

source: As a consumer you have rights when you purchase a service but there are no hard and fast rules
ga: Mar thomhaltóir, tá cearta agat nuair a cheannaíonn tú seirbhís ach níl aon rialacha dochta daingne i gceist

source: Every case is different and the solution to a problem with a service will depend on the circumstances of the case
ga: Tá gach aon chás difriúil agus braithfidh réiteach na faidhbe maidir le seirbhís ar an gcás ar leith

source: Many people offer services, these can be traders, tradesmen or professionals, here we use the term service supplier to indicate any person who supplies a service as a business or part of a business
ga: Tairgíonn go leor daoine seirbhísí, trádálaithe, ceardaithe nó daoine gairmiúla ina measc. Úsáideann muid an téarma ‘soláthraí seirbhíse’ anseo chun tagairt a dhéanamh d’aon duine a sholáthraíonn seirbhís mar ghnó nó mar chuid de ghnó

source: Here are some general guidelines that may help you to avoid problems when you purchase a service
ga: Tá roinnt treoirlínte ginearálta anseo a chuideoidh leat fadhbanna a sheachaint nuair a cheannaíonn tú seirbhís

source: What is a contract?
ga: Céard is conradh ann?

source: When you engage a service supplier you create a contract between you, as a consumer, and the service supplier
ga: Nuair a théann tú i mbannaí soláthraí seirbhíse cruthaíonn tú conradh idir tú féin, mar thomhaltóir, agus soláthraí na seirbhíse

source: A contract is an agreement between two or more people that is enforceable by law
ga: Is comhaontú foirmiúil idir beirt nó níos mó é conradh ar infheidhmithe faoin dlí é

source: Contracts may be written or oral and are made up of terms; some of which can be implied terms
ga: Is téarmaí atá i mbunús na gconarthaí, ar féidir le roinnt acu a bheith ina dtéarmaí intuigthe

source: Contracts may differ in many ways and there are no hard and fast rules governing what terms should be in a consumer contract
ga: Féadann go leor éagsúlachtaí a bheith idir conarthaí agus níl aon rialacha dochta daingne ann a rialaíonn na téarmaí ar ceart a bheith i gconradh tomhaltóireachta

source: Terms in consumer contracts, however, must always be fair and clear to the consumer
ga: Ní foláir do théarmaí i gconarthaí tomhaltóirí a bheith cothrom agus soiléir don tomhaltóir i gcónaí, áfach

source: Anyone involved in the contract should be clear about what their obligations are under the terms of the contract
ga: Ba cheart go mbeadh aon duine atá bainteach sa gconradh soiléir faoi na cúraimí atá orthú faoi théarmaí an chonartha

source: Consumer contracts are protected by the Sale of Goods and Supply of Services Act, 1980
ga: Is é an tAcht um Dhíol Earraí agus Soláthar Seirbhísí, 1980 a thugann cosaint do chonarthaí tomhaltóirí

source: If you have a contract with a service supplier you can expect that:
ga: Má tá conradh agat le soláthraí seirbhísí, féadfaidh tú bheith ag súil le:

source: • The supplier has the necessary skill to provide the service
ga: • dóthain oilteachta a bheith ar an soláthraí chun an tseirbhís a sholáthar

source: • The service will be provided with proper care and diligence
ga: • go soláthrófaí an tseirbhís le cúram agus le díograis chuí

source: • The materials used will be sound and that goods supplied with the service will be of merchantable quality
ga: • go mbeidh na hábhair a úsáidfear slán agus go mbeidh na hearraí a sholáthraítear leis an tseirbhís de cháilíocht indíolta

source: In a service contract, at the very least, you should ensure that you know the price of the service and the time that it will take to complete the agreed work
ga: I gconradh seirbhíse, ba cheart duit a chinntiú ar a laghad go bhfuil praghas na seirbhíse ar eolas agat chomh maith leis an am a thógfaidh sé chun an obair aontaithe a chur i gcrích

source: Consumers, when they buy goods and services are protected by unfair terms in consumer contract regulations
ga: Nuair a cheannaíonn tomhaltóirí earraí agus seirbhísí, tá siad cosanta faoi rialacháin an téarmaí míchothroma i gconarthaí tomhaltóra

source: This means that any term or implied term in a consumer contract that is found to be unfair to the consumer is null and void
ga: Ciallaíonn sé seo gur féidir aon téarma nó téarma intuigthe atá míchothrom i gconradh tomhaltóra a bheith curtha ar neamhní

source: Choosing your supplier of services
ga: Ag roghnú soláthraí do sheirbhísí

source: When you choose a service supplier what you need to take into account will depend on the service being provided
ga: Nuair a roghnaíonn tú soláthraí seirbhíse, braithfidh an méid a thógfaidh tú san áireamh ar an tseirbhís a sholáthraítear

source: The following general advice may be useful to you in choosing a service provider
ga: D’fhéadfadh an chomhairle ghinearálta seo a leanas a bheith úsáideach duit agus tú ag roghnú soláthraí seirbhíse

source: • Know what your budget is – you don’t need to disclose what you can afford if you are negotiating on price
ga: • Bíodh a fhios agat cén buiséad atá agat – ní gá duit a nochtadh cén praghas atá i d’acmhainn agus tú á phlé

source: • Be clear about what work you want carried out and put this down in writing
ga: • Bí soiléir faoin obair ar mhaith leat go ndéanfaí agus cuir síos é seo i bhfoirm scríbhneoireachta

source: If you don’t know what you want done the service supplier is not likely to know either
ga: Mura bhfuil a fhios agat céard ba mhaith leat go ndéanfadh an soláthraí seirbhíse, ní móide go mbeidh a fhios acusan ach oiread

source: • Choose a service supplier that specialises in the type and size of work you want carried out
ga: • Roghnaigh soláthraí seirbhíse a dhéanann speisialtóireacht sa chineál agus sa mhéid oibre a mbainfear amach

source: • Get several quotes detailing specifically what work needs to be done and the price you will have to pay
ga: • Faigh roinnt iarratas luacha ag sonrú go sainiúil cén obair is gá a dhéanamh agus an praghas a chaithfidh tú a íoc

source: The cheapest quote may not provide the best quality work
ga: Ní gá i gcónaí gurb é an t-iarratas luacha is saoire a sholáthróidh an caighdeán oibre is fearr

source: • If possible try to get a personal recommendation from an informed, experienced person
ga: • Más féidir, faigh moladh pearsanta ó dhuine le heolas, scil agus taithí maith

source: If possible, view other work that has been done, this will help you make your decision
ga: Más féidir, breathnaigh ar obair eile a rinneadh; cuideoidh sé seo leat agus tú ag déanamh cinnidh

source: Ask for previous references and follow them up
ga: Iarr teistiméireachtaí agus lean dóibh

source: • If possible, have a written contract or agreement in place to spell out what work is being done, timings, costs and any other important aspects
ga: • Más féidir, bíodh conradh scríofa nó comhaontú scríofa agat chun an obair, na hamanna, costais agus aon ghnéithe tábhachtacha eile a leagan amach

source: • Work out a payments schedule that is suitable for you and the service supplier
ga: • Oibrigh amach sceideal íocaíochta atá feiliúnach duit agus do do sholáthraí seirbhíse

source: Consider leaving payment (or a large instalment of payment) until after the job is completed and you are happy with the work
ga: Smaoinigh ar an íocaíocht a fhágáil go dtí an deireadh (nó síntiús mór den íocaíocht), nuair a bheidh an jab críochnaithe agus tú sásta leis an obair

source: • Make sure you get a fully itemised receipt
ga: Déan cinnte go bhfaigheann tú admháil leis na miontuairiscí uilig

source: • If there is a representative organisation for the particular trade that you are engaging ask if the trader is a member
ga: • Má tá eagraíocht ionadaíoch ann don cheird áirithe a bhfuil tú ag plé léi, iarr ar an gceardaí an ball den eagraíocht sin é/í

source: Some organisations have a consumer complaints service and may help with any problem that may arise
ga: Tá seirbhís ghearáin le haghaidh tomhaltóirí ag roinnt eagraíochtaí agus d’fhéadfadh siad cuidiú leat le haon fhadhb a thagann chun solais

source: You can find out more about complaining about home improvements here
ga: Is féidir leat tuilleadh a fháil amach faoi eagraíochtaí gairmiúla agus ceardaíochta anseo

source: • Make sure that you are contactable while the work is carried out so that the service supplier can contact you and discuss any potential problems
ga: • Déan cinnte gur féidir dul i dteagmháil leat ionas gur féidir leis an soláthraí seirbhíse dul i dteagmháil leat agus aon fhadhbanna a phlé

source: • Service suppliers should be insured against damage to goods, other people’s property or themselves whilst carrying out a service
ga: • Ba cheart go mbeadh árachas ag soláthraithe seirbhíse in aghaidh damáiste d’earraí, do mhaoin dhaoine eile nó dóibh féin agus iad ag soláthar na seirbhíse

source: Check that any trader that you engage has appropriate insurance
ga: Seiceáil go bhfuil árachas cuí ag aon trádálaí a bpléann tú leo

source: • You may have to pay a deposit to a service supplier to indicate that you intend to purchase their service. You should be clear about your and the service suppliers obligations if you pay a deposit
ga: • Seans go mbeidh ort éarlas a íoc don soláthraí seirbhíse chun a shonrú go bhfuil sé ar intinn agat a gcuid seirbhíse a cheannacht

source: Specifically see under what circumstances you can get a full refund on this deposit
ga: Léigh tuilleadh faoi éarlaisí anseo

source: • Ask if completed work is guaranteed – you can read more about guarantees here
ga: • Faigh amach an bhfuil ráthaíocht i gceist – léigh tuilleadh faoi ráthaíochtaí anseo

source: A guarantee is additional to your rights mentioned above
ga: Is mar bharr ar do chearta a luadh thuas atá ráthaíocht

source: What to do if things go wrong
ga: Céard atá le déanamh má théann rudaí mícheart

source: If things go wrong it is always the service supplier who should put things right
ga: Má thiteann rudaí sa bhfraoch, is é an soláthraí seirbhíse i gcónaí ar cheart cúrsaí a chur ceart

source: As a general rule, the service supplier can repair or replace the service
ga: Mar riail ghinearálta, is féidir leis an soláthraí seirbhíse an tseirbhís a athchur nó a dheisiú

source: Alternatively they can refund the costs of the service to the consumer
ga: De rogha air sin, féadann siad costais na seirbhíse don tomhaltóir a aisíoc

source: If you are not satisfied with the quality of goods or services you should
ga: Mura mbíonn tú sásta le caighdeán na n-earraí ná na seirbhísí, ba cheart duit

source: • Act as soon as you can – a delay can indicate that you have accepted faulty services
ga: Gníomh a ghlacadh chomh luath agus is féidir leat – féadann moill a chur in iúl gur ghlac tú le hearraí nó le seirbhísí lochtacha

source: • Do not attempt to repair what went wrong yourself or give it to anyone else to repair it
ga: Gan iarracht a dhéanamh an mhír a dheisiú tú féin ná a thabhairt do dhuine ar bith eile í lena deisiú

source: • Make sure that you have a proof of purchase (a receipt, cheque stub, credit card statement or invoice)
ga: A chinntiú go bhfuil cruthúnas ceannaigh agat (admháil, comhdhuille seice, ráiteas chárta creidmheasa nó sonrasc)

source: • Keep all evidence of damage caused by shoddy work – take photos etc
ga: Gach fianaise a choinneáil den damáiste de bharr na hoibre boichte – glac grianghraf etc

source: It is obviously better to avoid problems so raise any concerns that you may have as the work progresses
ga: Is soiléir go bhfuil sé níos fearr fadhbanna a sheachaint, mar sin ardaigh aon chúis bhuartha a d’fhéadfadh a bheith agat de réir mar a théann an obair ar aghaidh

source: Where possible, make yourself available for the trader to contact you so that he or she can raise any issues that come up
ga: Más féidir, bí ar fáil chun gur féidir leis an trádálaí dul i dteagmháil leat ionas gur féidir leis/léi aon chúrsaí a thagann chun solais a phlé leat

source: If you need to make a complaint read this advice on making a complaint in advance
ga: Más gá duit gearán a dhéanamh léigh an chomhairle seo faoi ghearán a dhéanamh roimh ré

source: You may get advice and help from one of the trade and representative organisations listed here
ga: Seans go bhfaighfeá comhairle agus cúnamh ó cheann de na heagraíochtaí trádála agus ionadaíocha liostaithe anseo

source: If you have exhausted the traders complaints mechanism you can take your claim to the Small Claims Court
ga: Má tá meicníocht ghearáin na dtrádálaithe ídithe agat, is féidir leat d’éileamh a thógáil sa Chúirt Mhionéilimh

source: There is a small fee to take a case to the Small Claims Court which is non refundable
ga: Tá táille beag le cás a thógáil sa Chúirt Mhionéilimh agus ní féidir é sin a aisíoc duit

source: The Competition and Consumer Protection Commission will give advice for free but you should check with any other organisation if they charge for their services
ga: Tabharfaidh Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí comhairle duit saor in aisce ach ba cheart duit seiceáil le haon eagraíocht eile má chuireann siad costais ar na seirbhísí seo

source: The Competition and Consumer Protection Commission can give you information on your rights if you have problems with a service or a service provider
ga: Is féidir leis an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí eolas a thabhairt duit ar do chearta má bhíonn fadhbanna agat le seirbhís nó le soláthraí seirbhíse
